Repository: BenjaminChoron/smart_pantry
Catalog: lib/l10n/intl_*.arb
Languages: de, es, fr

source: Add
de: Hinzufügen
es: Agregar
fr: Ajouter

# addedToPantry
source: Item added to pantry!
de: Artikel zum Vorrat hinzugefügt!
es: ¡Elemento agregado a la despensa!
fr: Article ajouté au garde-manger !

# addedToShoppingList
source: Item added to shopping list!
de: Artikel zur Einkaufsliste hinzugefügt!
es: ¡Elemento agregado a la lista de compras!
fr: Article ajouté à la liste de courses !

source: Add New Recipe
de: Neues Rezept hinzufügen
fr: Ajouter une nouvelle recette

source: Add Pantry Item
de: Zum Vorrat hinzufügen
es: Agregar a la despensa
fr: Ajouter au garde-manger

source: Add Shopping List Item
de: Zur Einkaufsliste hinzufügen
es: Agregar a la lista de compras
fr: Ajouter à la liste de courses

# appDevelopedBy
source: Developed by Benjamin Choron
de: Entwickelt von Benjamin Choron
es: Desarrollado por Benjamin Choron
fr: Développé par Benjamin Choron

# appExpirationDateManagementContent
source: This application offers the display of products approaching their expiration date within five days before they expire. After the expiration date, they remain displayed in red on this list until they are removed.
de: Diese Anwendung bietet die Anzeige von Produkten, die sich ihrem Ablaufdatum nähern, innerhalb von fünf Tagen vor ihrem Ablauf. Nach dem Ablaufdatum bleiben sie rot auf dieser Liste angezeigt, bis sie entfernt werden.
es: Esta aplicación ofrece la visualización de productos que se acercan a su fecha de vencimiento dentro de los cinco días anteriores a su vencimiento. Después de la fecha de vencimiento, permanecen en rojo en esta lista hasta que se eliminan.
fr: Cette application offre l'affichage des produits approchant de leur date d'expiration dans les cinq jours précédant leur expiration. Après la date d'expiration, ils restent affichés en rouge sur cette liste jusqu'à ce qu'ils soient supprimés.

# appExpirationDateManagementTitle
source: Expiration date management
de: Ablaufdatumverwaltung
es: Gestión de fechas de vencimiento
fr: Gestion des dates d'expiration

# appInformationsButton
source: Informations
de: Informationen
es: Informaciones

# appStorageInformationsContent
source: This application uses local storage to save your data. This means that your data is stored on your device and is not shared with any third party. Warning, if you delete the app, you will lose all this data.
de: Diese Anwendung verwendet den lokalen Speicher, um Ihre Daten zu speichern. Das bedeutet, dass Ihre Daten auf Ihrem Gerät gespeichert sind und nicht mit Dritten geteilt werden. Achtung, wenn Sie die App löschen, verlieren Sie alle diese Daten.
es: Esta aplicación utiliza el almacenamiento local para guardar sus datos. Esto significa que sus datos se almacenan en su dispositivo y no se comparten con terceros. Advertencia, si elimina la aplicación, perderá todos estos datos.
fr: Cette application utilise le stockage local pour enregistrer vos données. Cela signifie que vos données sont stockées sur votre appareil et ne sont pas partagées avec des tiers. Attention, si vous supprimez l'application, vous perdrez toutes ces données.

# appStorageInformationsTitle
source: Information related to storage
de: Informationen zum Speicher
es: Información de almacenamiento
fr: Informations de stockage

# categoryName
source: {name, select, All {All} Fruits {Fruits & Vegetables} Fish {Fish Shop} Butcher {Butcher Shop} Dairy {Dairy} Fresh {Fresh} Bakery {Bakery} Snacks {Snacks} Drinks {Drinks} Frozen {Frozen} Grocery {Grocery} Other {Other}}
de: {name, select, All {Alle} Fruits {Obst & Gemüse} Fish {Fisch} Butcher {Metzgerei} Dairy {Milchprodukte} Fresh {Frisch} Bakery {Bäckerei} Snacks {Snacks} Drinks {Getränke} Frozen {Tiefkühl} Grocery {Lebensmittel} Other {Sonstiges}}
es: {name, select, All {Todos} Fruits {Frutas y Verduras} Fish {Pescado} Butcher {Carnicería} Dairy {Lácteos} Fresh {Frescos} Bakery {Panadería} Snacks {Snacks} Drinks {Bebidas} Frozen {Congelados} Grocery {Comestibles} Other {Otros}}
fr: {name, select, All {Tout} Fruits {Fruits & Légumes} Fish {Poissonnerie} Butcher {Boucherie} Dairy {Produits Laitiers} Fresh {Frais} Bakery {Boulangerie} Snacks {Snacks} Drinks {Boissons} Frozen {Surgelés} Grocery {Épicerie} Other {Autre}}

# darkTheme
source: Dark
de: Dunkel
es: Oscuro
fr: Sombre

# expirationLabel
source: Expiration Date
de: Ablaufdatum
es: Fecha de vencimiento
fr: Date d'expiration

# expirationRange
source: Within 5 days
de: Innerhalb von 5 Tagen
es: Dentro de 5 días
fr: Dans les 5 jours

# expirationTitle
source: Expiration Dates
de: Ablaufdaten
es: Fechas de vencimiento
fr: Dates d'expiration

source: Expired
de: Abgelaufen
es: Vencido
fr: Expiré

# failedToAddItem
source: Failed to add item... Please try again later.
de: Artikel konnte nicht hinzugefügt werden... Bitte versuchen Sie es später noch einmal.
es: No se pudo agregar el elemento... Por favor, inténtelo de nuevo más tarde.
fr: Impossible d'ajouter l'élément... Veuillez réessayer plus tard.

# failedToRemoveItem
source: Failed to remove item... Please try again later.
de: Artikel konnte nicht entfernt werden... Bitte versuchen Sie es später noch einmal.
es: No se pudo eliminar el elemento... Por favor, inténtelo de nuevo más tarde.
fr: Impossible de supprimer l'élément... Veuillez réessayer plus tard.

# failedToUpdateItem
source: Failed to update item... Please try again later.
de: Artikel konnte nicht aktualisiert werden... Bitte versuchen Sie es später noch einmal.
es: No se pudo actualizar el elemento... Por favor, inténtelo de nuevo más tarde.
fr: Impossible de mettre à jour l'élément... Veuillez réessayer plus tard.

source: hours
de: Stunden
fr: Heures

source: Language
de: Sprache
es: Idioma
fr: Langue

# lightTheme
source: Light
de: Hell
es: Claro
fr: Clair

source: minutes
de: Minuten

# mustBePositive
source: Must be a positive number
de: Muss eine positive Zahl sein
es: Debe ser un número positivo
fr: Doit être un nombre positif

# mustHaveCharacters
source: Must be between 1 and 30 characters
de: Muss zwischen 1 und 30 Zeichen enthalten
es: Debe contener entre 1 y 30 caracteres
fr: Doit contenir entre 1 et 30 caractères

# newIngredientLabel
source: New Ingredient
de: Neue Zutat

# noItems
source: No items added yet.
de: Derzeit keine Artikel hinzugefügt.
es: No hay elementos agregados por el momento.
fr: Aucun élément ajouté pour le moment.

# pantryDialogActionNo
source: No
de: Nein
fr: Non

# pantryDialogActionYes
source: Yes
de: Ja
es: Sí
fr: Oui

# pantryDialogConfirmContent
source: Do you really want to remove this item from your pantry?
de: Möchten Sie diesen Artikel wirklich aus Ihrem Vorrat entfernen?
es: ¿Realmente quiere eliminar este elemento de su despensa?
fr: Voulez-vous vraiment supprimer cet élément de votre garde-manger ?

# pantryDialogDismissContent
source: Do you want to add this item to your shopping list?
de: Möchten Sie diesen Artikel zu Ihrer Einkaufsliste hinzufügen?
es: ¿Quiere agregar este elemento a su lista de compras?
fr: Voulez-vous ajouter cet élément à votre liste de courses ?

# pantryDialogDismissTitle
source: Add to shopping list
de: Zur Einkaufsliste hinzufügen

# pantryDialogTitle
source: Pantry Item Removal
de: Entfernen eines Artikels aus dem Vorrat
es: Eliminación de un elemento de la despensa
fr: Suppression d'un élément du garde-manger

# pantryTitle
source: Pantry
de: Vorrat
es: Despensa
fr: Garde-manger

# quantityLabel
source: Quantity
de: Menge
es: Cantidad
fr: Quantité

# recipeCost
source: Cost
de: Kosten
fr: Coût

# recipeCostLabel
source: Cost
de: Kosten
fr: Coût

# recipeCostName
source: {name, select, Low {Low} Medium {Medium} High {High}}
de: {name, select, Low {Niedrig} Medium {Mittel} High {Hoch}}
fr: {name, select, Low {Faible} Medium {Moyen} High {Élevé}}

# recipeDescription
source: Description
de: Beschreibung

# recipeDifficulty
source: Difficulty
de: Schwierigkeit
fr: Difficulté

# recipeDifficultyLabel
source: Difficulty
de: Schwierigkeit
fr: Difficulté

# recipeDifficultyName
source: {name, select, Easy {Easy} Medium {Medium} Hard {Hard}}
de: {name, select, Easy {Einfach} Medium {Mittel} Hard {Schwer}}
fr: {name, select, Easy {Facile} Medium {Moyen} Hard {Difficile}}

# recipeIngredients
source: Ingredients
de: Zutaten
fr: Ingrédients

# recipeSteps
source: Steps
de: Schritte
fr: Étapes

# recipesTitle
source: Recipes
de: Rezepte
fr: Recettes

# recipeTimeLabel
source: Time
de: Zeit
fr: Temps

# recipeTypeLabel
source: Type
de: Typ

# recipeTypeName
source: {name, select, Breakfast {Breakfast} Lunch {Lunch} Dinner {Dinner} Snack {Snack} Dessert {Dessert}}
de: {name, select, Breakfast {Frühstück} Lunch {Mittagessen} Dinner {Abendessen} Snack {Snack} Dessert {Dessert}}
fr: {name, select, Breakfast {Petit-déjeuner} Lunch {Déjeuner} Dinner {Dîner} Snack {Collation} Dessert {Dessert}}

source: Reset
de: Zurücksetzen
es: Restablecer
fr: Réinitialiser

# settingsTitle
source: Settings
de: Einstellungen
es: Configuraciones
fr: Paramètres

# shoppingListAddToPantryDialogActionNo
source: No
de: Nein
fr: Non

# shoppingListAddToPantryDialogActionYes
source: Yes
de: Ja
es: Sí
fr: Oui

# shoppingListAddToPantryDialogConfirmContent
source: Did you purchase that item and want to add it to the pantry?
de: Haben Sie diesen Artikel gekauft und möchten ihn zum Vorrat hinzufügen?
es: ¿Compró ese artículo y desea agregarlo a la despensa?
fr: Avez-vous acheté cet article et souhaitez-vous l'ajouter au garde-manger ?

# shoppingListAddToPantryDialogTitle
source: Shopping List Purchased Item
de: Gekaufter Artikel der Einkaufsliste
es: Artículo comprado de la lista de compras
fr: Article acheté de la liste de courses

# shoppingListRemoveDialogActionNo
source: No
de: Nein
fr: Non

# shoppingListRemoveDialogActionYes
source: Yes
de: Ja
es: Sí
fr: Oui

# shoppingListRemoveDialogConfirmContent
source: Do you really want to remove this item from your shopping list?
de: Möchten Sie diesen Artikel wirklich von Ihrer Einkaufsliste entfernen?
es: ¿Realmente quiere eliminar este elemento de su lista de compras?
fr: Voulez-vous vraiment supprimer cet élément de votre liste de courses ?

# shoppingListRemoveDialogTitle
source: Shopping List Item Removal
de: Entfernen eines Artikels von der Einkaufsliste
es: Eliminación de un elemento de la lista de compras
fr: Suppression d'un élément de la liste de courses

# shoppingListTitle
source: Shopping List
de: Einkaufsliste
es: Lista de compras
fr: Liste de courses

# stepsLabel
source: Steps
de: Schritte

# storageName
source: {name, select, All {All} Fridge {Fridge} Freezer {Freezer} Cupboard {Cupboard}}
de: {name, select, All {Alle} Fridge {Kühlschrank} Freezer {Gefrierschrank} Cupboard {Schrank}}
es: {name, select, All {Todos} Fridge {Refrigerador} Freezer {Congelador} Cupboard {Alacena}}
fr: {name, select, All {Tous} Fridge {Réfrigérateur} Freezer {Congélateur} Cupboard {Placard}}

source: Store
de: Laden

source: Theme
de: Thema
es: Tema
fr: Thème

source: Update
de: Aktualisieren
es: Actualizar
fr: Mettre à jour

# whereToStore
source: Where do you want to store this item?
de: Wo möchten Sie diesen Artikel aufbewahren?

# nameLabel
source: Name
es: Nombre
fr: Nom

# systemTheme
source: System
es: Sistema
fr: Système

# appVersion
source: Version {version}
es: Versión {version}
